Autodesk.Revit.DB.NurbSpline.Create(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{System.Double})
Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Remarks:
Knots and degree of the spline are computed from the control points and weights.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The control points array must contain at least 4 points.
-or-
The weights array must be the same size as the control points array.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.DB.NurbSpline.Create(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{System.Double},System.Collections.Generic.IList`1{System.Double},System.Int32,System.Boolean,System.Boolean)
Creates a new geometric NURBSpline object.
Remarks:
Degree must be 3 or greater.  If rational, the control points and weights array must be the same size.
There must be at least degree+1 control points.
The size of knots must equal the sum of degree, the size of the controlPoints array and 1. The first
degree+1 knots should be identical, as should the last degree+1 knots.
The knots in the middle of the sequence must be non-decreasing.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
knots:
The knots of the NURBSpline.
degree:
The degree of the NURBSpline.
closed:
True if the NURBSpline should be closed, false otherwise.
rational:
True if the NURBSpline is rational, false if it is irrational.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Degree must be >= 3.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
For a rational NurbSpline, the weights array must be the same size as the control points array.
-or-
The control points array must contain at least degree + 1 points, and if closed,
the first and last points in the control points array must be identical.
-or-
The size of knots must equal the sum of degree, the size of the controlPoints array and 1. The first
degree+1 knots should be identical, as should the last degree+1 knots.
The knots in the middle of the sequence must be non-decreasing.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.DB.NurbSpline.SetControlPointsAndWeights(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.DoubleArray)
Set the control points, weights simultaneously.